<?php

declare(strict_types=1);

namespace Lodestone\Game;

class ClassJobsJapanese
{
    // pull from: https://xivapi.com/classjob?columns=ID,Name&language=ja
    /** @var array<int, string> */
    const array ROLES = [
        0 => '冒険者',
        1 => '格闘士',
        2 => '斧術士',
        3 => '槍術士',
        4 => '槍術士',
        5 => '弓術士',
        6 => '幻術士',
        7 => '呪術士',
        8 => '木工師',
        9 => '鍛冶師',
        10 => '甲冑師',
        11 => '彫金師',
        12 => '革細工師',
        13 => '裁縫師',
        14 => '錬金術師',
        15 => '調理師',
        16 => '採掘師',
        17 => '園芸師',
        18 => '漁師',
        19 => 'ナイト',
        20 => 'モンク',
        21 => '戦士',
        22 => '竜騎士',
        23 => '吟遊詩人',
        24 => '白魔道士',
        25 => '黒魔道士',
        26 => '巴術士',
        27 => '召喚士',
        28 => '学者',
        29 => '双剣士',
        30 => '忍者',
        31 => '機工士',
        32 => '暗黒騎士',
        33 => '占星術師',
        34 => '侍',
        35 => '赤魔道士',
        36 => '青魔道士',
        37 => 'ガンブレイカー',
        38 => '踊り子',
        39 => 'リーパー',
        40 => '賢者'
    ];
}
